_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 44, 44, 128)       3328      
_________________________________________________________________
batch_normalization_1 (Batch (None, 44, 44, 128)       512       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 42, 42, 128)       147584    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 21, 21, 128)       0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 21, 21, 128)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 19, 19, 256)       295168    
_________________________________________________________________
batch_normalization_2 (Batch (None, 19, 19, 256)       1024      
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 18, 18, 256)       262400    
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 9, 9, 256)         0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 9, 9, 256)         0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 7, 7, 512)         1180160   
_________________________________________________________________
batch_normalization_3 (Batch (None, 7, 7, 512)         2048      
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 6, 6, 512)         1049088   
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 3, 3, 512)         0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 3, 3, 512)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 4608)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 2048)              9439232   
_________________________________________________________________
batch_normalization_4 (Batch (None, 2048)              8192      
_________________________________________________________________
dropout_4 (Dropout)          (None, 2048)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 1024)              2098176   
_________________________________________________________________
batch_normalization_5 (Batch (None, 1024)              4096      
_________________________________________________________________
dropout_5 (Dropout)          (None, 1024)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 7)                 7175      
=================================================================
Total params: 14,498,183
Trainable params: 14,490,247
Non-trainable params: 7,936
_________________________________________________________________
