_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_1 (Flatten)          (None, 2304)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 1537)              3542785   
_________________________________________________________________
dense_2 (Dense)              (None, 1534)              2359292   
_________________________________________________________________
dropout_1 (Dropout)          (None, 1534)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 1534)              2354690   
_________________________________________________________________
dropout_2 (Dropout)          (None, 1534)              0         
_________________________________________________________________
dense_4 (Dense)              (None, 1534)              2354690   
_________________________________________________________________
dropout_3 (Dropout)          (None, 1534)              0         
_________________________________________________________________
dense_5 (Dense)              (None, 1534)              2354690   
_________________________________________________________________
dropout_4 (Dropout)          (None, 1534)              0         
_________________________________________________________________
dense_6 (Dense)              (None, 1534)              2354690   
_________________________________________________________________
dropout_5 (Dropout)          (None, 1534)              0         
_________________________________________________________________
dense_7 (Dense)              (None, 7)                 10745     
=================================================================
Total params: 15,331,582
Trainable params: 15,331,582
Non-trainable params: 0
_________________________________________________________________
