_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 46, 46, 128)       1280      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 44, 44, 128)       147584    
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 42, 42, 128)       147584    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 21, 21, 128)       0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 21, 21, 128)       0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 19, 19, 256)       295168    
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 17, 17, 256)       590080    
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 16, 16, 256)       262400    
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 8, 8, 256)         0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 8, 8, 256)         0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 6, 6, 512)         1180160   
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 5, 5, 512)         1049088   
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 4, 4, 512)         1049088   
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 2, 2, 512)         0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 2, 2, 512)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 2048)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dropout_4 (Dropout)          (None, 2048)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 1024)              2098176   
_________________________________________________________________
dropout_5 (Dropout)          (None, 1024)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 512)               524800    
_________________________________________________________________
dense_4 (Dense)              (None, 7)                 3591      
=================================================================
Total params: 11,545,351
Trainable params: 11,545,351
Non-trainable params: 0
_________________________________________________________________
